{
    "resources": {
        "boii_loadscreen_beta": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_loadscreen_gamma": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_minigames": {
            "version": "0.0.1",
            "notes": []
        },
        "boii_target": {
            "version": "0.3.0",
            "notes": [
                "Fixed issue with distance checks not actually working.",
                "Fixed issue with targeting models now works correctly.",
                "Reversed menu layout now populates right -> left instead of left -> right so targets with one option populate the way everyones used too.",
                "Made some adjustments to debugging functions."
            ]
        },
        "boii_proputil": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_ui": {
            "version": "1.1.0",
            "notes": [
                "Added support for control disables to make bridging easier for qb progressbar.",
                "Added a action menu using ui style of boii_target supports nested submenus."
            ]
        },
        "boii_utils": {
            "version": "1.6.0",
            "notes": [
                "Moved all utils tables into configs instead of in being at bottom of individual files. Local functions are still assigned here.",
                "Removed empty vehicle keys table from server config ideas for this have changed.",
                "Modified licence update function to accept table params.",
                "Split ui.lua into two files notifications.lua and progressbar.lua.",
                "Updated readme file as tebex version was missing a readme."
            ]
        },
        "boii_drugplanes": {
            "version": "0.0.3",
            "notes": []
        },
        "boii_jobcenter": {
            "version": "0.0.1",
            "notes": []
        },
        "boii_trickortreat": {
            "version": "0.0.1",
            "notes": []
        },
        "boii_rptests": {
            "version": "1.1.0",
            "notes": [
                "Fixed issue with ox_target 1.14.0 breaking peds with more than action assigned.",
                "Fixed issue with licence data not being updated correctly, this requires utils v1.6.0.",
                "Fixed issue with esx not retrieving player data correctly to set name on tablet, this also requires utils v1.6.0.",
                "Fixed issue with ox_inventory removing weapon given by firearms test and added a config toggle for ox_inventory users. This must be set to true if using ox_inventory.",
                "Added note to ox_inventory readme to cover toggling this within config.",
                "Replaced all use of utils.notify.send for new utils ui bridge utils.ui.notify.",
                "Added new section show_licence to config here you can set the range and if the source player should be included when showing licences.",
                "Added note to keys section directing to utils keys list in case people want to change keys.",
                "Added clear vehicles in area to the trailer spawn for truck test so cars do not spawn underneath.",
                "Added missing var to end of firearms test that was stopping people taking a second test without leaving server first."
            ]
        },
        "boii_pawnshop": {
            "version": "1.0.5",
            "notes": [
                "Moved the boii_target remove_target export as it was creating errors for none boii_target users."
            ]
        },
        "boii_atmheists": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_chat": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_hobolife": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_items": {
            "version": "0.2.0",
            "notes": [
                "Removed export file from fxmanifest as no longer used.",
                "Added files section into fxmanifest.",
                "Added assets folder to allow for items to hold the images required by scripts.",
                "Added check and logging for duplicated items on item register."
            ]
        },
        "boii_statuses": {
            "version": "0.1.1",
            "notes": [
                "Fixed buffs not being removed after duration timeout"
            ]
        },
        "boii_core": {
            "version": "0.1.0",
            "notes": []
        },
        "boii_hud": {
            "version": "0.1.0",
            "notes": []
        }      
    }
}
  
