{
    "resources": {
        "boii_loadscreen_beta": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_loadscreen_gamma": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_minigames": {
            "version": "0.0.1",
            "notes": []
        },
        "boii_target": {
            "version": "0.5.0",
            "notes": [
                "Changed targets.zones.models to targets.models.",
                "Remove need for defining a bone when setting target options on player peds.",
                "Added support for global peds with type disabling use new function add_ped(options)."
            ]
        },
        "boii_proputil": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_ui": {
            "version": "1.1.0",
            "notes": [
                "Added support for control disables to make bridging easier for qb progressbar.",
                "Added a action menu using ui style of boii_target supports nested submenus."
            ]
        },
        "boii_utils": {
            "version": "1.8.4",
            "notes": [
                "Character Creation: - Removed some debug prints",
                "Framework: + Added item boxes for qb inventory actions.",
                "Framework: + Corrected issue with has_item checks for ox_inventory."
            ]
        },
        "boii_drugplanes": {
            "version": "0.0.3",
            "notes": []
        },
        "boii_jobcenter": {
            "version": "0.0.1",
            "notes": []
        },
        "boii_trickortreat": {
            "version": "0.0.1",
            "notes": []
        },
        "boii_rptests": {
            "version": "1.1.0",
            "notes": [
                "Fixed issue with ox_target 1.14.0 breaking peds with more than action assigned.",
                "Fixed issue with licence data not being updated correctly, this requires utils v1.6.0.",
                "Fixed issue with esx not retrieving player data correctly to set name on tablet, this also requires utils v1.6.0.",
                "Fixed issue with ox_inventory removing weapon given by firearms test and added a config toggle for ox_inventory users. This must be set to true if using ox_inventory.",
                "Added note to ox_inventory readme to cover toggling this within config.",
                "Replaced all use of utils.notify.send for new utils ui bridge utils.ui.notify.",
                "Added new section show_licence to config here you can set the range and if the source player should be included when showing licences.",
                "Added note to keys section directing to utils keys list in case people want to change keys.",
                "Added clear vehicles in area to the trailer spawn for truck test so cars do not spawn underneath.",
                "Added missing var to end of firearms test that was stopping people taking a second test without leaving server first."
            ]
        },
        "boii_pawnshop": {
            "version": "1.0.5",
            "notes": [
                "Moved the boii_target remove_target export as it was creating errors for none boii_target users."
            ]
        },
        "boii_atmheists": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_chat": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_hobolife": {
            "version": "1.0.1",
            "notes": [
                "Added in readme sections containing item lists for other cores."
            ]
        },
        "boii_items": {
            "version": "0.5.1",
            "notes": [
                "Added usable flag to all default items.",
                "Usable item registration is now only done for items flagged usable, some items have no use but are in here to remain droppable.",
                "Changed version check to actually check for this resource.. my bad."
            ]
        },
        "boii_statuses": {
            "version": "0.1.1",
            "notes": [
                "Fixed buffs not being removed after duration timeout"
            ]
        },
        "boii_core": {
            "version": "0.1.0",
            "notes": []
        },
        "boii_hud": {
            "version": "0.1.0",
            "notes": []
        },
        "boii_drugsales": {
            "version": "1.1.0",
            "notes": [
                "Resource is now entirely source available.",
                "Added a fix for item registering sometimes not registering phone item until script restart.",
                "Added fix for being able to sell drugs to bulk dealer ped.",
                "Added XP rewards to dealing and deliveries, this was forgotten about and was only added to bulk.",
                "Refactored some events to use reusable functions.",
                "Removed client config entirely was only used to set target version now this is in server/config.lua.",
                "Removed config option for boii_items this is no longer required with new utils item setup method.",
                "Removed left over test command."
            ]
        },
        "boii_crafting": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_dispensaries": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_dispatch": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_loadingscreens": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_items_new": {
            "version": "0.3.1",
            "notes": [
                "Updated setup instructions for qb and ps inventory to cover adding / removing items.",
                "Removed development debug prints and chat spam messages."
            ]
        },
        "boii_hunting": {
            "version": "1.0.2",
            "notes": [
                "Removed debug prints",
                "Fixed issue with selling stores not opening through boii ui dialogue."
            ]
        }
    }
}
  
