{
    "resources": {
        "boii_loadscreen_beta": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_loadscreen_gamma": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_minigames": {
            "version": "0.0.1",
            "notes": []
        },
        "boii_target": {
            "version": "0.4.0",
            "notes": [
                "Updated default style to follow theme of other free boii resources."
            ]
        },
        "boii_proputil": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_ui": {
            "version": "1.1.0",
            "notes": [
                "Added support for control disables to make bridging easier for qb progressbar.",
                "Added a action menu using ui style of boii_target supports nested submenus."
            ]
        },
        "boii_utils": {
            "version": "1.7.0",
            "notes": [
                "Blips: Updated notes for some of the functions.",
                "Framework: Modified server side get_balance function to return item cash for boii_core if balance_type = cash.",
                "Framework: Added new callback to allow retrieving players id on client side.",
                "UI: Corrected fxmanifest load order as progressbar could not access notify.",
                "UI: Fixed issue with progressbar bridge notifications",
                "Groups: Added a specified leader option to groups.",
                "Groups: Modified group setup to allow for having a group image.",
                "Groups: Added new server functions is_member and is_leader to check if player is member or leader of a group respectively.",
                "Groups: Added new server function get_groups_of_type to retrieve all groups of a specified type.",
                "Groups: Added new server function close_group to allow leaders to close a group.",
                "Groups: Modified add function to now accept a params of player_details when adding players instead of using identity info directly.",
                "Dates: Added new function to get time difference in seconds between two timestamps."
            ]
        },
        "boii_drugplanes": {
            "version": "0.0.3",
            "notes": []
        },
        "boii_jobcenter": {
            "version": "0.0.1",
            "notes": []
        },
        "boii_trickortreat": {
            "version": "0.0.1",
            "notes": []
        },
        "boii_rptests": {
            "version": "1.1.0",
            "notes": [
                "Fixed issue with ox_target 1.14.0 breaking peds with more than action assigned.",
                "Fixed issue with licence data not being updated correctly, this requires utils v1.6.0.",
                "Fixed issue with esx not retrieving player data correctly to set name on tablet, this also requires utils v1.6.0.",
                "Fixed issue with ox_inventory removing weapon given by firearms test and added a config toggle for ox_inventory users. This must be set to true if using ox_inventory.",
                "Added note to ox_inventory readme to cover toggling this within config.",
                "Replaced all use of utils.notify.send for new utils ui bridge utils.ui.notify.",
                "Added new section show_licence to config here you can set the range and if the source player should be included when showing licences.",
                "Added note to keys section directing to utils keys list in case people want to change keys.",
                "Added clear vehicles in area to the trailer spawn for truck test so cars do not spawn underneath.",
                "Added missing var to end of firearms test that was stopping people taking a second test without leaving server first."
            ]
        },
        "boii_pawnshop": {
            "version": "1.0.5",
            "notes": [
                "Moved the boii_target remove_target export as it was creating errors for none boii_target users."
            ]
        },
        "boii_atmheists": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_chat": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_hobolife": {
            "version": "1.0.0",
            "notes": []
        },
        "boii_items": {
            "version": "0.3.0",
            "notes": [
                "Added config.target toggle to client side init.lua.",
                "Fixed issue with consume_item function not checking for empty results correctly.",
                "Added setup instructions for qb-inventory (new), ps-inventory & ox_inventory.",
                "Added support for qb-target + ox_target."
            ]
        },
        "boii_statuses": {
            "version": "0.1.1",
            "notes": [
                "Fixed buffs not being removed after duration timeout"
            ]
        },
        "boii_core": {
            "version": "0.1.0",
            "notes": []
        },
        "boii_hud": {
            "version": "0.1.0",
            "notes": []
        }      
    }
}
  
